title: Suspicious PowerShell EncodedCommand
id: powershell-encodedcommand
description: Detects use of EncodedCommand in PowerShell, often used in malware
status: stable
logsource:
  product: windows
  service: security
  category: process_creation
detection:
  selection:
    CommandLine|contains: "EncodedCommand"
  condition: selection
level: high
tags:
  - attack.execution
  - attack.t1059.001
